org/2019/observe-yourself-from-perspective-of-outsiders.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 时常以局外人的角度观察自己

我们不是完人，所以我们免不了要犯错。犯了错误就要改正，这样才会有进步。

我经常以上帝视角审视自己，观察自己的所作所为，分辨在自己做的事情里面，哪些是真正有价值的、哪些是纯粹为了自娱的、哪些又是为了娱人的。

人是感性动物，却时常被要求理性权衡利弊，这种矛盾就注定我们是痛苦的。我们不得不面对这种被分割的痛苦，一方面我们想要享受，另一方面我们又要实现自己的价值。

*矛盾必然存在，但并非不可调节。* 时间安排、事情先后，总能够把我们的欲望与理想安排得妥妥当当。我们要做自己的掌舵人，把握好前进的方向，小心不要和别人发生矛盾，因为大家有共同的远方。
