blog/2019/observe-yourself-from-perspective-of-outsiders.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>时常以局外人的角度观察自己</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">时常以局外人的角度观察自己</h1>
</header><p>
我们不是完人，所以我们免不了要犯错。犯了错误就要改正，这样才会有进步。
</p>

<p>
我经常以上帝视角审视自己，观察自己的所作所为，分辨在自己做的事情里面，哪些是真正有价值的、哪些是纯粹为了自娱的、哪些又是为了娱人的。
</p>

<p>
人是感性动物，却时常被要求理性权衡利弊，这种矛盾就注定我们是痛苦的。我们不得不面对这种被分割的痛苦，一方面我们想要享受，另一方面我们又要实现自己的价值。
</p>

<p>
<b>矛盾必然存在，但并非不可调节。</b> 时间安排、事情先后，总能够把我们的欲望与理想安排得妥妥当当。我们要做自己的掌舵人，把握好前进的方向，小心不要和别人发生矛盾，因为大家有共同的远方。
</p>
</div>
</body>
</html>